In [1]:
#!/usr/bin/env python3
# -*- coding: utf-8 -*-
"""
Created on Mon Nov 14 20:24:36 2022

@author: Januario Cipriano
"""

'\nCreated on Mon Nov 14 20:24:36 2022\n\n@author: Januario Cipriano\n'

In [2]:
%autosave 5

Autosaving every 5 seconds

In [4]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plot
from sklearn.impute import SimpleImputer
from sklearn.model_selection import train_test_split

In [88]:
from sklearn.preprocessing import LabelEncoder
from sklearn.preprocessing import MinMaxScaler
from sklearn.preprocessing import OneHotEncoder
from sklearn.preprocessing import StandardScaler

In [91]:
from sklearn.linear_model import LinearRegression

In [6]:
df = pd.read_csv('../Exercise Files/Datasets/insurance.csv')
df.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [7]:
count_na = df.isnull().sum()

In [8]:
count_na

age         0
sex         0
bmi         5
children    0
smoker      0
region      0
charges     0
dtype: int64

In [9]:
count_na[count_na > 0]

bmi    5
dtype: int64

In [10]:
df.drop('bmi', axis=1, inplace=True)

In [11]:
count_na = df.isnull().sum()
count_na

age         0
sex         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [12]:
count_na[count_na > 0]

Series([], dtype: int64)

In [13]:
df2 = pd.read_csv('../Exercise Files/Datasets/insurance.csv')
df2.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [14]:
df2.dropna(inplace=True)
df2.reset_index(drop=True, inplace=True)

In [15]:
count_na = df2.isnull().sum()
count_na

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [16]:
count_na[count_na > 0]

Series([], dtype: int64)

In [74]:
df3 = pd.read_csv('../Exercise Files/Datasets/insurance.csv')
df3.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [75]:
count_na = df3.isnull().sum()
count_na

age         0
sex         0
bmi         5
children    0
smoker      0
region      0
charges     0
dtype: int64

In [76]:
imputer = SimpleImputer(strategy='mean')
imputer.fit(df3['bmi'].values.reshape(-1, 1))
df3['bmi'] = imputer.transform(
    df3['bmi'].values.reshape(-1, 1))

In [77]:
count_na = df3.isnull().sum()
count_na

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [78]:
count_na[count_na > 0]

Series([], dtype: int64)

In [23]:
df4 = pd.read_csv('../Exercise Files/Datasets/insurance.csv')
df4.head()

   age     sex     bmi  children smoker     region      charges
0   19  female  27.900         0    yes  southwest  16884.92400
1   18    male  33.770         1     no  southeast   1725.55230
2   28    male  33.000         3     no  southeast   4449.46200
3   33    male  22.705         0     no  northwest  21984.47061
4   32    male  28.880         0     no  northwest   3866.85520

In [24]:
df4['bmi'].fillna(df4['bmi'].mean(), inplace=True)

In [25]:
count_na = df4.isnull().sum()
count_na

age         0
sex         0
bmi         0
children    0
smoker      0
region      0
charges     0
dtype: int64

In [26]:
count_na[count_na > 0]

Series([], dtype: int64)

In [27]:
region = df['region']
region_encoded, region_categories = pd.factorize(region)

In [28]:
region_encoded

array([0, 1, 1, ..., 1, 0, 2], dtype=int64)

In [29]:
region_categories

Index(['southwest', 'southeast', 'northwest', 'northeast'], dtype='object')

In [30]:
factor_region_mapping = dict(zip(region_categories,
                                 region_encoded))

In [31]:
factor_region_mapping

{'southwest': 0, 'southeast': 1, 'northwest': 1, 'northeast': 2}

In [32]:
region = df['region']
region_encoded = pd.get_dummies(region, prefix='')

In [33]:
region_encoded

      _northeast  _northwest  _southeast  _southwest
0              0           0           0           1
1              0           0           1           0
2              0           0           1           0
3              0           1           0           0
4              0           1           0           0
...          ...         ...         ...         ...
1333           0           1           0           0
1334           1           0           0           0
1335           0           0           1           0
1336           0           0           0           1
1337           0           1           0           0

[1338 rows x 4 columns]

In [79]:
sex = df3.iloc[:, 1:2].values
smoker = df3.iloc[:, 4:5].values

In [80]:
le = LabelEncoder()
sex[:, 0] = le.fit_transform(sex[:, 0])
sex = pd.DataFrame(sex)
sex.columns = ['sex']
le_sex_mapping = dict(zip(le.classes_,
                          le.transform(le.classes_)))

In [38]:
sex

     sex
0      0
1      1
2      1
3      1
4      1
...   ..
1333   1
1334   0
1335   0
1336   0
1337   0

[1338 rows x 1 columns]

In [39]:
le_sex_mapping

{'female': 0, 'male': 1}

In [81]:
le = LabelEncoder()
smoker[:, 0] = le.fit_transform(smoker[:, 0])
smoker = pd.DataFrame(smoker)
smoker.columns = ['smoker']
le_smoker_mapping = dict(zip(le.classes_,
                             le.transform(le.classes_)))

In [41]:
smoker

     smoker
0         3
1         2
2         2
3         1
4         1
...     ...
1333      1
1334      0
1335      2
1336      3
1337      1

[1338 rows x 1 columns]

In [44]:
ohe = OneHotEncoder()

In [48]:
# region = ohe.fit_transform(region).toarray()
# region = pd.DataFrame(region)
# region.columns = ['northeast', 'northwest', 
#                   'southeast', 'southwest']
# region

In [47]:
# region = df.iloc[:,5:6].values #ndarray

# ## ohe for region
# ohe = OneHotEncoder() 

# region = ohe.fit_transform(region).toarray()
# region = pd.DataFrame(region)
# region.columns = ['northeast', 'northwest', 'southeast', 'southwest']
# print("Sklearn one hot encoder results for region:")  
# print(region[:10])

In [82]:
X_num = df3[['age', 'bmi', 'children']].copy()

In [58]:
X_num

      age     bmi  children
0      19  27.900         0
1      18  33.770         1
2      28  33.000         3
3      33  22.705         0
4      32  28.880         0
...   ...     ...       ...
1328   50  30.970         3
1329   18  31.920         0
1330   18  36.850         0
1331   21  25.800         0
1332   61  29.070         0

[1333 rows x 3 columns]

In [83]:
X_final = pd.concat([X_num, region, sex, smoker], axis=1)

In [71]:
X_final

,age,bmi,children,0,1,2,3,4,5,6,...,1329,1330,1331,1332,1333,1334,1335,1336,sex,smoker
0,19.0,27.900,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,1
1,18.0,33.770,1.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1,0
2,28.0,33.000,3.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1,0
3,33.0,22.705,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1,0
4,32.0,28.880,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1333,NaN,NaN,NaN,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,1,0
1334,NaN,NaN,NaN,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0
1335,NaN,NaN,NaN,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0
1336,NaN,NaN,NaN,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,0
1337,NaN,NaN,NaN,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0,1

In [84]:
y_final = df3[['charges']].copy()

In [64]:
y_final

          charges
0     16884.92400
1      1725.55230
2      4449.46200
3     21984.47061
4      3866.85520
...           ...
1328  10600.54830
1329   2205.98080
1330   1629.83350
1331   2007.94500
1332  29141.36030

[1333 rows x 1 columns]

In [85]:
X_train, X_test, y_train, y_test = train_test_split(
    X_final, y_final, test_size=0.33, random_state=0
)

In [86]:
# X_train, X_test, y_train, y_test = train_test_split(
#     data[['age']], y_final, test_size = 0.33, random_state = 0 )

In [89]:
n_scaler = MinMaxScaler()
X_train = n_scaler.fit_transform(X_train.astype(np.float))
X_test = n_scaler.transform(X_test.astype(np.float))

In [90]:
s_scaler = StandardScaler()
X_train = s_scaler.fit_transform(X_train.astype(np.float))
X_test = s_scaler.transform(X_test.astype(np.float))

In [92]:
lr = LinearRegression()

In [93]:
lr.fit(X_train, y_train)

LinearRegression()

In [94]:
y_train_pred = lr.predict(X_train)

In [95]:
y_test_pred = lr.predict(X_test)

In [98]:
print("lr.coef_: {}".format(lr.coef_))

lr.coef_: [[-489.15404344 1042.71135882  467.87976576 ... 1327.91791853
   135.59963431 4513.70348645]]

In [99]:
print("lr.intercept_: {}".format(lr.intercept_))

lr.intercept_: [13141.35083164]

In [106]:
print('lr train score %.3f, lr test score: %.3f' % (
lr.score(X_train,y_train),
lr.score(X_test, y_test)))

lr train score 1.000, lr test score: 0.473